---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRailGeom
source: html/588e5124-0c50-e04d-2f85-cd2caaed7a9e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRailGeom Property

Can't create geometry for one or more Rails

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateRailGeom { get; }
```